# Standard Deviation

1. Standard deviation is a number that describes how spreads out the values
2. A low standard deviation means that most of the numbers are close to the mean(average) value
3. A high standard deviation means that most of the numbers are spread out over the wider range

**Example - We have some registered cars of speed [7] to calculate standard deviation**

![](https://www.gstatic.com/education/formulas2/397133473/en/population_standard_deviation.svg)

1. sigma	=	population standard deviation
2. N	=	the size of the population
3. x_i	=	each value from the population
4. mu	=	the population mean

In [1]:
speed = [86,87,88,86,87,85,86]

In [3]:
import numpy as np

In [4]:
x = np.mean(speed)
print(x)

86.42857142857143

1. X_i =  [86,87,88,86,87,85,86]
2. mu(Average) = 86.43
3. N = 7

In [5]:
import numpy as np
speed = [86,87,88,86,87,85,86]

x = np.std(speed)
print(x)

0.9035079029052513

In [6]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.std(speed_1)
print(x)

40.49416967635931

In [7]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.mean(speed_1)
print(x)

91.0

1. Meaning that most of the values the range of 40.49 form the mean value, which is 91.0
2. Higher standard deviation indicates that values are spred out over the wider range

In [9]:
import pandas as pd
import numpy as np

In [10]:
df = pd.read_csv('car_sales_data.csv')

In [11]:
df.head(10)

,Unnamed: 0,Name_of_company,Unit Cars,car_sales,prod_cost,price,profit,percent
0,0,Tata,10000,6000,600000,NaN,200000,33.333333
1,1,Mahindra,15000,9000,600000,NaN,400000,66.666667
2,2,Tesla,20000,12000,600000,NaN,600000,100.000000
3,3,Hero,7500,3500,600000,700000.0,100000,16.666667
4,4,Bajaj,10000,5000,600000,900000.0,300000,50.000000
5,5,Toyato,12000,6000,600000,1000000.0,400000,66.666667
6,6,BMW,8000,4000,600000,800000.0,500000,83.333333
7,7,Toyato,12000,6000,600000,NaN,400000,66.666667

In [12]:
df1= df.drop(['Unnamed: 0'], axis=True)

In [13]:
df1.head(10)

,Name_of_company,Unit Cars,car_sales,prod_cost,price,profit,percent
0,Tata,10000,6000,600000,NaN,200000,33.333333
1,Mahindra,15000,9000,600000,NaN,400000,66.666667
2,Tesla,20000,12000,600000,NaN,600000,100.000000
3,Hero,7500,3500,600000,700000.0,100000,16.666667
4,Bajaj,10000,5000,600000,900000.0,300000,50.000000
5,Toyato,12000,6000,600000,1000000.0,400000,66.666667
6,BMW,8000,4000,600000,800000.0,500000,83.333333
7,Toyato,12000,6000,600000,NaN,400000,66.666667

In [15]:
x = np.mean(df1)
df2 = df1.fillna(x)

In [16]:
df2.head(10)

,Name_of_company,Unit Cars,car_sales,prod_cost,price,profit,percent
0,Tata,10000,6000,600000,850000.0,200000,33.333333
1,Mahindra,15000,9000,600000,850000.0,400000,66.666667
2,Tesla,20000,12000,600000,850000.0,600000,100.000000
3,Hero,7500,3500,600000,700000.0,100000,16.666667
4,Bajaj,10000,5000,600000,900000.0,300000,50.000000
5,Toyato,12000,6000,600000,1000000.0,400000,66.666667
6,BMW,8000,4000,600000,800000.0,500000,83.333333
7,Toyato,12000,6000,600000,850000.0,400000,66.666667

In [17]:
df2.describe()

,Unit Cars,car_sales,prod_cost,price,profit,percent
count,8.000000,8.000000,8.0,8.000000,8.000000,8.000000
mean,11812.500000,6437.500000,600000.0,850000.000000,362500.000000,60.416667
std,4087.764845,2795.883454,0.0,84515.425473,159798.980866,26.633163
min,7500.000000,3500.000000,600000.0,700000.000000,100000.000000,16.666667
25%,9500.000000,4750.000000,600000.0,837500.000000,275000.000000,45.833333
50%,11000.000000,6000.000000,600000.0,850000.000000,400000.000000,66.666667
75%,12750.000000,6750.000000,600000.0,862500.000000,425000.000000,70.833333
max,20000.000000,12000.000000,600000.0,1000000.000000,600000.000000,100.000000

In [18]:
df2.corr()

           Unit Cars  car_sales  prod_cost     price    profit   percent
Unit Cars   1.000000   0.986299        NaN  0.320466  0.676593  0.676593
car_sales   0.986299   1.000000        NaN  0.256942  0.633502  0.633502
prod_cost        NaN        NaN        NaN       NaN       NaN       NaN
price       0.320466   0.256942        NaN  1.000000  0.370220  0.370220
profit      0.676593   0.633502        NaN  0.370220  1.000000  1.000000
percent     0.676593   0.633502        NaN  0.370220  1.000000  1.000000

# Variance

1. Variance is another number that indicates how spread out the values are
2. If you take the square root of the variance you get the standard deviation

### To calculate Variance of Dataset using below steps
1. Finding the mean(the average).
2. Subtracting the mean from each number in the data set and then squaring the result. The results are squared to make the negatives positive. Otherwise negative numbers would cancel out the positives in the next step. It’s the distance from the mean that’s important, not positive or negative numbers.
3. Averaging the squared differences.

![](https://www.gstatic.com/education/formulas2/397133473/en/sample_variance.svg)

1. S^2	=	sample variance
2. x_i	=	the value of the one observation
3. bar{x}	=	the mean value of all observations
4. n	=	the number of observations

### 1. Finding the Mean(Average)

In [19]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.mean(speed_1)
print(x)

91.0

### 2.  For each value : The difference from the mean

In [25]:
print("30 - 91.0 =",30 - 91.0)
print("41 - 91.0 =",41 - 91.0)
print("56 - 91.0 =",56 - 91.0)
print("122 - 91.0 =",122 - 91.0)
print("142 - 91.0 =",142 - 91.0)
print("152 - 91.0 = ",152 - 91.0)
print("89 - 91.0 =",89 - 91.0)
print("91 - 91.0 =",91 - 91.0)
print("96 - 91.0 =",96 - 91.0)

30 - 91.0 = -61.0
41 - 91.0 = -50.0
56 - 91.0 = -35.0
122 - 91.0 = 31.0
142 - 91.0 = 51.0
152 - 91.0 =  61.0
89 - 91.0 = -2.0
91 - 91.0 = 0.0
96 - 91.0 = 5.0

### step 3 - For each Difference - find squre value

In [27]:
print("square of -61.0=",-61.0 ** 2)
print("square of -50.0 =",-50.0 ** 2)
print("square of -35.0 =",-35.0 ** 2)
print("square of 31.0 =",31.0 ** 2)
print("square of 51.0 =",51.0 ** 2)
print("square of 61.0 =",61.0 ** 2)
print("square of -2.0 =",-2.0 ** 2)
print("square of 0.0 =",0.0 ** 2)
print("square of 5.0 =",5.0 ** 2)

square of -61.0= -3721.0
square of -50.0 = -2500.0
square of -35.0 = -1225.0
square of 31.0 = 961.0
square of 51.0 = 2601.0
square of 61.0 = 3721.0
square of -2.0 = -4.0
square of 0.0 = 0.0
square of 5.0 = 25.0

### step 4 - The variance is the average number of square differences

In [34]:
(3721.0 + 2500.0 + 1225.0 + 961.0 + 2601.0 + 3721.0 + 4.0 + 0.0 + 25.0) / 9

1639.7777777777778

In [35]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.var(speed_1)
print(x)

1639.7777777777778

# Standard Deviation

#### square root of variance:
    1. Under root of 1639.7777777777778

### Symbol 
1. Standard Deviation = sigma
2. Variance =  sigma square

# Percentage

In [36]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.percentile(speed_1,75)
print(x)

122.0

In [37]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.percentile(speed_1, 25)
print(x)

56.0

In [38]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.percentile(speed_1,50)
print(x)

91.0

In [40]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.max(speed_1)
print(x)

152

In [41]:
speed_1 = [30,41,56,122,142,152,89,91,96]

x = np.min(speed_1)
print(x)

30